rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "ouoe"]]
---
  def same_director
    movie = Movie.find params[:id]
    director = movie.director

    @movies = Movie.where(director: director)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def directors
    @movie = Movie.find(params[:id])
    @movies = @movie.similar_directors
    if (@movies-[@movie]).empty?